AppGenerateRoverDatas/app/controllers/rovers_controller.rb

  def index
    @rovers = Rover.all
---
SELECT "rovers".* FROM "rovers"

  def create
    @rover = Rover.new(rover_params)

    respond_to do |format|
      if @rover.save
---
INSERT INTO "rovers" ("puntoPartenzaX", "puntoPartenzaY", "direzioneN", "direzioneS", "direzioneE", "direzioneW", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @rover.update(rover_params)
---
UPDATE "rovers" SET "puntoPartenzaY" = ?, "updated_at" = ? WHERE "rovers"."id" = ?  [["puntoPartenzaY", 4.0666], ["updated_at", "2022-12-08 19:03:59.777012"], ["id", 1]]

    def set_rover
      @rover = Rover.find(params[:id])
---
SELECT "rovers".* FROM "rovers" WHERE "rovers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]