AppGenerateRoverDatas/app/controllers/api/v1/rovers_controller.rb

SELECT "rovers".* FROM "rovers"
---
  def index
    render json: {status: 'SUCCESS', message: 'Loaded all posts', data: Rover.all}, status: :ok